ecdr/elua/src/platform/lm3s/platform.c
  if( d->running != 1 )
  {
    adc_update_dev_sequence( 0 );

    MAP_ADCSequenceEnable( ADC_BASE, d->seq_id );
    d->running = 1;

    if( d->clocked == 1 )
    {
      MAP_TimerControlTrigger(timer_base[d->timer_id], TIMER_A, true);
      MAP_TimerEnable(timer_base[d->timer_id], TIMER_A);
    }
    else
    {
      MAP_ADCProcessorTrigger( ADC_BASE, d->seq_id );
    }
  }
  
  return PLATFORM_OK;
}

#endif // ifdef BUILD_ADC


// ****************************************************************************
// Analog comparator
//
// TODO: Add code for comparators

#ifdef BUILD_COMP

// LM4F120 - 2 comparators
// C0, positive input PC6, negative input, PC7, output PF0
// C1, positive input PC5, negative input, PC4, output PF1

#ifdef FORLM4F

const static u32 comp_in_ports[] =  { GPIO_PORTC_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE, GPIO_PORTC_BASE };
const static u8 comp_in_pins[] =    { GPIO_PIN_6, GPIO_PIN_7, GPIO_PIN_5, GPIO_PIN_4 };

// FIXME: Need special handling to reprogram Port F0, also note F1 is chanel of LED
const static u32 comp_out_ports[] =  { GPIO_PORTF_BASE, GPIO_PORTF_BASE };
const static u8 comp_out_pins[] =    { GPIO_PIN_0, GPIO_PIN_1 };

const static u32 comp_ctls[] = { 0, 1 };
// all comparators use same base - COMP_BASE

const static u32 comp_ints[] = { INT_COMP0, INT_COMP1 };

// Predefined reference values, in order
const static u32 comp_refs[] = {};	// Voltage bins
const static u32 comp_ref_codes[] = {};	// Codes used by library
#define NUM_COMP_REFS	(sizeof(comp_refs)/sizeof(u32))

#endif // FORLM4F


// TODO: What can you do with a comparator 
// Generate an output
// Generate an interrupt
// Trigger ADC

// Compare to pin or to internal reference

static void comps_init()
{
}

// Translate whatever voltage reference scheme eLua uses to platform specific
// FIXME: for now vref is reference voltage * 1000 (maybe should make it * 1024)
static unsigned long comp_ref_encode(unsigned vref)
{
// Assuming that bins are of fairly uniform width - use an index search
/* FIXME: Pseudocode
n bins between VMIN and VMAX
	if vref < VMIN -> 0
	if vref > VMAX -> NUM_COMP_REFS-1
	i = ((vref - VMIN) * NUM_COMP_REFS )/(VMAX-VMIN);	// Want integer division
	ASSERT (comp_refs[i] <= vref <= comp_refs[i+1]);
	return i;			// Actually, return whichever is nearer to vref
*/
}

// Translate back from platform voltage ref to eLua 
static unsigned comp_ref_decode(unsigned long refcode)
{
	return comp_refs[i];
};

static unsigned comp_ref_index;

// This platform only allows one vref
unsigned platform_comp_ref_set(unsigned vref)
{
	unsigned long refindex;

	comp_ref_index = comp_vref_encode( vref);
	ComparatorRefSet(COMP_BASE, comp_ref_codes[comp_ref_index]);
	return comp_vref_decode(comp_ref_index);

};

unsigned platform_comp_ref_get(unsigned id)
{
	return comp_vref_decode(comp_ref_index);
};

unsigned long platform_comp_value_get(unsigned id)
{
	return MAP_ComparatorValueGet(COMP_BASE, id);
}; // Actually returns boolean





#endif // ifdef BUILD_COMP


// ****************************************************************************
// Support for specific onboard devices on 
// Texas Instruments / Luminary Micro kits.
//
// FIXME: This was previously tied to the "disp" module but should be renamed in the future
//        to include support for initialization of other onboard devices of the EK-LM3Sxxxx kits.
//        Note that not all kits have all devices available.
#ifdef ENABLE_DISP

void lm3s_disp_init( unsigned long freq )
{
  RIT128x96x4Init( freq );
}

void lm3s_disp_clear()
{
  RIT128x96x4Clear();
}

void lm3s_disp_stringDraw( const char *str, unsigned long x, unsigned long y, unsigned char level )
{
  RIT128x96x4StringDraw( str, x, y, level );
}

void lm3s_disp_imageDraw( const unsigned char *img, unsigned long x, unsigned long y,
                              unsigned long width, unsigned long height )
{
  RIT128x96x4ImageDraw( img, x, y, width, height );
}


void lm3s_disp_enable( unsigned long freq )
{
  RIT128x96x4Enable( freq );
}

void lm3s_disp_disable()
{
  RIT128x96x4Disable();
}

void lm3s_disp_displayOn()
{
  RIT128x96x4DisplayOn();
}

void lm3s_disp_displayOff()
{
  RIT128x96x4DisplayOff();
}

#endif

// ****************************************************************************
// Ethernet functions

static void eth_init()
{
#ifdef BUILD_UIP
  u32 user0, user1, temp;
  static struct uip_eth_addr sTempAddr;

  // Enable and reset the controller
  MAP_SysCtlPeripheralEnable( SYSCTL_PERIPH_ETH );
  MAP_SysCtlPeripheralReset( SYSCTL_PERIPH_ETH );

#if defined( FORLM3S9B92 ) || defined(FORLM3S9D92)
  GPIOPinConfigure(GPIO_PF2_LED1);
  GPIOPinConfigure(GPIO_PF3_LED0);
#endif

  // Enable Ethernet LEDs
  MAP_GPIODirModeSet( GPIO_PORTF_BASE, GPIO_PIN_2 | GPIO_PIN_3, GPIO_DIR_MODE_HW );
  MAP_GPIOPadConfigSet( GPIO_PORTF_BASE, GPIO_PIN_2 | GPIO_PIN_3, GPIO_STRENGTH_2MA, GPIO_PIN_TYPE_STD );

  // Configure SysTick for a periodic interrupt.
  MAP_SysTickPeriodSet( MAP_SysCtlClockGet() / SYSTICKHZ);
  MAP_SysTickEnable();
  MAP_SysTickIntEnable();

  // Initialize the Ethernet Controller and disable all Ethernet Controller interrupt sources.
  MAP_EthernetIntDisable(ETH_BASE, (ETH_INT_PHY | ETH_INT_MDIO | ETH_INT_RXER |
                     ETH_INT_RXOF | ETH_INT_TX | ETH_INT_TXER | ETH_INT_RX));
  temp = MAP_EthernetIntStatus(ETH_BASE, false);
  MAP_EthernetIntClear(ETH_BASE, temp);

  // Initialize the Ethernet Controller for operation.
  MAP_EthernetInitExpClk(ETH_BASE, MAP_SysCtlClockGet());

  // Configure the Ethernet Controller for normal operation.
  // - Full Duplex
  // - TX CRC Auto Generation
  // - TX Padding Enabled
  MAP_EthernetConfigSet(ETH_BASE, (ETH_CFG_TX_DPLXEN | ETH_CFG_TX_CRCEN | ETH_CFG_TX_PADEN));

  // Enable the Ethernet Controller.
  MAP_EthernetEnable(ETH_BASE);

  // Enable the Ethernet interrupt.
  MAP_IntEnable(INT_ETH);

  // Enable the Ethernet RX Packet interrupt source.
  MAP_EthernetIntEnable(ETH_BASE, ETH_INT_RX);

  // Enable all processor interrupts.
  MAP_IntMasterEnable();

